In [1]:
import pandas as pd
import numpy as np

In [2]:
#Task1
#Creating project DataFrame
project_df = pd.DataFrame({
    "ID": ["A001", "A002", "A003", "A004", "A005", "A002", "A005", "A003", "A001", "A003", "A001", "A004", "A004", "A005"],
    "Project": ["Project 1", "Project 2", "Project 3", "Project 4", "Project 5", "Project 6", "Project 7", "Project 8", "Project 9", "Project 10", "Project 11", "Project 12", "Project 13", "Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished", "Failed", "Finished", "Failed", "Ongoing", "Finished", "Failed", "Ongoing", "Finished", "Finished"]
})
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [3]:
#Task1
#saving project DataFrame  as .csv
project_df.to_csv("Project_DataFrame.csv", index = False)

In [4]:
#Task1
#Creating Employee DataFrame
employee_df = pd.DataFrame({
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30]
})
employee_df

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [5]:
#Task1
#saving employee DataFrame  as .csv
employee_df.to_csv("Employee_DataFrame.csv", index = False)

In [6]:
#Task1
#Creating Seniority Level DataFrame
seniority_level_df = pd.DataFrame({
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation Level": [2, 2, 3, 2, 3]
})
seniority_level_df

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [7]:
#Task1
#saving Seniority Level DataFrame  as .csv
seniority_level_df.to_csv("Seniority_Level_DataFrame.csv", index = False)

In [8]:
#Task2
#To read the project dataframe.csv file
project_df = pd.read_csv("Project_DataFrame.csv")

In [9]:
#Task2
# Using for loop to fill the missing values
for i in range(len(project_df)):
    if pd.isnull(project_df.loc[i, 'Cost']):   #Check if value is missing(NaN).
        prev_values = project_df.loc[:i-1, 'Cost'].dropna()  # Take all previous non-null values and compute their mean
        if len(prev_values) > 0:
            running_avg = prev_values.mean()
            project_df.loc[i, 'Cost'] = running_avg  #Replacing the missing values
        else:
            project_df.loc[i, 'Cost'] = 0

In [10]:
#Task2
#Saving updated dataframe
project_df.to_csv("Project_Updated_DataFrame.csv", index = False)

In [11]:
#Task2
#Display updated project table
print(project_df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [12]:
#Task3
#To read the employee dataframe.csv file
employee_df = pd.read_csv("Employee_DataFrame.csv")

In [13]:
#Task3
# Spliting the name column from employee table two new columns as first name and last name
employee_df[['First Name', 'LastName']] = employee_df['Name'].str.split(' ', expand=True)

In [14]:
#Task3
# Removing the old "Name" column from the table
employee_df = employee_df.drop(columns=['Name'])

In [15]:
#Task3
#Saving updated dataframe
employee_df.to_csv("Employee_split_DataFrame.csv", index = False)

In [16]:
#Task3
#Display updated employee table
print(employee_df)

     ID Gender     City  Age First Name   LastName
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [17]:
#Task4
#Loading all the files after updated
project_df = pd.read_csv("Project_Updated_DataFrame.csv")
employee_df = pd.read_csv("Employee_split_DataFrame.csv")
seniority_level_df = pd.read_csv("Seniority_Level_DataFrame.csv")

In [18]:
#Task4
#Joining Project and Employee dataframes using common key i.e "ID" (with the help of merge function)
merge1 = pd.merge(project_df, employee_df, on='ID', how='inner')

In [19]:
#Task4
# Joining the merged data frame with Seniority level data frame
Final = pd.merge(merge1, seniority_level_df, on='ID', how='inner')

In [20]:
#Task4
#Saving updated single dataframe
Final.to_csv("Final.csv", index=False)

In [21]:
#Task4
#Dispaly of All three dataframes in single dataframe(merged)
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,LastName,Designation Level
0,A001,Project 1,1002000.0,Finished,M,Paris,25,John,Alter,2
1,A002,Project 2,2000000.0,Ongoing,F,London,27,Alice,Luxumberg,2
2,A003,Project 3,4500000.0,Finished,M,Berlin,29,Tom,Sabestine,3
3,A004,Project 4,5500000.0,Ongoing,F,Newyork,31,Nina,Adgra,2
4,A005,Project 5,3250500.0,Finished,F,Madrid,30,Amy,Johny,3
5,A002,Project 6,680000.0,Failed,F,London,27,Alice,Luxumberg,2
6,A005,Project 7,400000.0,Finished,F,Madrid,30,Amy,Johny,3
7,A003,Project 8,350000.0,Failed,M,Berlin,29,Tom,Sabestine,3
8,A001,Project 9,2210312.5,Ongoing,M,Paris,25,John,Alter,2
9,A003,Project 10,300000.0,Finished,M,Berlin,29,Tom,Sabestine,3
10,A001,Project 11,2000000.0,Failed,M,Paris,25,John,Alter,2
11,A004,Project 12,1000000.0,Ongoing,F,Newyork,31,Nina,Adgra,2
12,A004,Project 13,3000000.0,Finished,F,Newyork,31,Nina,Adgra,2
13,A005,Project 14,200000.0,Finished,F,Madrid,30,Amy,Johny,3

In [22]:
#Task5
#To read the Final dataframe.csv file
Final = pd.read_csv("Final.csv")

In [23]:
#Task5
# Adding Bonus Column(5% of project cost) if the project status is completed, else no bonus (0)
Final['Bonus'] = np.where(Final['Status'] == 'Finished', Final['Cost'] * 0.05, 0)

In [24]:
#Task5
#Saving updated dataframe
Final.to_csv("Final_with_bonus.csv", index=False)

In [25]:
#Task5
#Dispaly of Bonus updated dataframe
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,LastName,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,M,Paris,25,John,Alter,2,50100.0
1,A002,Project 2,2000000.0,Ongoing,F,London,27,Alice,Luxumberg,2,0.0
2,A003,Project 3,4500000.0,Finished,M,Berlin,29,Tom,Sabestine,3,225000.0
3,A004,Project 4,5500000.0,Ongoing,F,Newyork,31,Nina,Adgra,2,0.0
4,A005,Project 5,3250500.0,Finished,F,Madrid,30,Amy,Johny,3,162525.0
5,A002,Project 6,680000.0,Failed,F,London,27,Alice,Luxumberg,2,0.0
6,A005,Project 7,400000.0,Finished,F,Madrid,30,Amy,Johny,3,20000.0
7,A003,Project 8,350000.0,Failed,M,Berlin,29,Tom,Sabestine,3,0.0
8,A001,Project 9,2210312.5,Ongoing,M,Paris,25,John,Alter,2,0.0
9,A003,Project 10,300000.0,Finished,M,Berlin,29,Tom,Sabestine,3,15000.0
10,A001,Project 11,2000000.0,Failed,M,Paris,25,John,Alter,2,0.0
11,A004,Project 12,1000000.0,Ongoing,F,Newyork,31,Nina,Adgra,2,0.0
12,A004,Project 13,3000000.0,Finished,F,Newyork,31,Nina,Adgra,2,150000.0
13,A005,Project 14,200000.0,Finished,F,Madrid,30,Amy,Johny,3,10000.0

In [26]:
#Task6
#To read the Final with Bonus dataframe.csv file
Final = pd.read_csv("Final_with_bonus.csv")

In [27]:
#Task6
#Identifying the failed projects by checking status
mask = Final['Status'].str.contains('fail', case=False, na=False)

In [28]:
#Task6
#Demote designation level by 1 for failed projects
Final.loc[mask, 'Designation Level'] = Final.loc[mask, 'Designation Level'] + 1

In [29]:
#Task6
#Remove records where Designation Level > 4
Final = Final[Final['Designation Level'] <= 4]  #Here the condition checks final['Designation Level'] <= 4  <-- this creates a boolean series if it is true then retain else it will be remove

In [30]:
#Task6
#Saving updated dataframe
Final.to_csv("Final_updated.csv", index=False)

In [31]:
#Task6
#Dispaly of updated dataframe
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,LastName,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,M,Paris,25,John,Alter,2,50100.0
1,A002,Project 2,2000000.0,Ongoing,F,London,27,Alice,Luxumberg,2,0.0
2,A003,Project 3,4500000.0,Finished,M,Berlin,29,Tom,Sabestine,3,225000.0
3,A004,Project 4,5500000.0,Ongoing,F,Newyork,31,Nina,Adgra,2,0.0
4,A005,Project 5,3250500.0,Finished,F,Madrid,30,Amy,Johny,3,162525.0
5,A002,Project 6,680000.0,Failed,F,London,27,Alice,Luxumberg,3,0.0
6,A005,Project 7,400000.0,Finished,F,Madrid,30,Amy,Johny,3,20000.0
7,A003,Project 8,350000.0,Failed,M,Berlin,29,Tom,Sabestine,4,0.0
8,A001,Project 9,2210312.5,Ongoing,M,Paris,25,John,Alter,2,0.0
9,A003,Project 10,300000.0,Finished,M,Berlin,29,Tom,Sabestine,3,15000.0
10,A001,Project 11,2000000.0,Failed,M,Paris,25,John,Alter,3,0.0
11,A004,Project 12,1000000.0,Ongoing,F,Newyork,31,Nina,Adgra,2,0.0
12,A004,Project 13,3000000.0,Finished,F,Newyork,31,Nina,Adgra,2,150000.0
13,A005,Project 14,200000.0,Finished,F,Madrid,30,Amy,Johny,3,10000.0

In [32]:
#Task7
#To read the updated Final dataframe.csv file
Final = pd.read_csv("Final_updated.csv")

In [44]:
#Task7
#Creating logic to add the Mr./Mrs. to the first name
for i in range(len(Final)):
    if Final.loc[i, 'Gender'] == 'M':  #Check the Gender if it is M, return to next statement and add 'Mr.' else add 'Mrs.'
        Final.loc[i, 'First Name'] = 'Mr. ' + Final.loc[i, 'First Name']
    else:
        Final.loc[i, 'First Name'] = 'Mrs. ' + Final.loc[i, 'First Name']

In [45]:
#Task7
#Removing the Gender from the Final dataframe after adding prefix
Final.drop('Gender', axis=1, inplace=True)

In [46]:
#Task7
#Saving updated dataframe
Final.to_csv("Final_updated_prefix", index=False)

In [47]:
#Task7
#Display of updated dataframe
Final

,ID,Project,Cost,Status,City,Age,First Name,LastName,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,Paris,25,Mr. John,Alter,2,50100.0
1,A002,Project 2,2000000.0,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0.0
2,A003,Project 3,4500000.0,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000.0
3,A004,Project 4,5500000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0.0
4,A005,Project 5,3250500.0,Finished,Madrid,30,Mrs. Amy,Johny,3,162525.0
5,A002,Project 6,680000.0,Failed,London,27,Mrs. Alice,Luxumberg,3,0.0
6,A005,Project 7,400000.0,Finished,Madrid,30,Mrs. Amy,Johny,3,20000.0
7,A003,Project 8,350000.0,Failed,Berlin,29,Mr. Tom,Sabestine,4,0.0
8,A001,Project 9,2210312.5,Ongoing,Paris,25,Mr. John,Alter,2,0.0
9,A003,Project 10,300000.0,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000.0
10,A001,Project 11,2000000.0,Failed,Paris,25,Mr. John,Alter,3,0.0
11,A004,Project 12,1000000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0.0
12,A004,Project 13,3000000.0,Finished,Newyork,31,Mrs. Nina,Adgra,2,150000.0
13,A005,Project 14,200000.0,Finished,Madrid,30,Mrs. Amy,Johny,3,10000.0

In [48]:
#Task8
#To read the updated Final dataframe.csv file
Final = pd.read_csv("Final_updated_prefix")

In [49]:
#Task8
#Creating logic to promte designation level by 1 for those age is more than 29
for i in range(len(Final)):
    if Final.loc[i, 'Age'] > 29:
        Final.loc[i, 'Designation Level'] = Final.loc[i, 'Designation Level'] - 1

In [50]:
#Task8
#Saving updated dataframe
Final.to_csv("Final_updated_designation.csv", index=False)

In [51]:
#Task8
#Display of updated dataframe
Final

,ID,Project,Cost,Status,City,Age,First Name,LastName,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,Paris,25,Mr. John,Alter,2,50100.0
1,A002,Project 2,2000000.0,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0.0
2,A003,Project 3,4500000.0,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000.0
3,A004,Project 4,5500000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,1,0.0
4,A005,Project 5,3250500.0,Finished,Madrid,30,Mrs. Amy,Johny,2,162525.0
5,A002,Project 6,680000.0,Failed,London,27,Mrs. Alice,Luxumberg,3,0.0
6,A005,Project 7,400000.0,Finished,Madrid,30,Mrs. Amy,Johny,2,20000.0
7,A003,Project 8,350000.0,Failed,Berlin,29,Mr. Tom,Sabestine,4,0.0
8,A001,Project 9,2210312.5,Ongoing,Paris,25,Mr. John,Alter,2,0.0
9,A003,Project 10,300000.0,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000.0
10,A001,Project 11,2000000.0,Failed,Paris,25,Mr. John,Alter,3,0.0
11,A004,Project 12,1000000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,1,0.0
12,A004,Project 13,3000000.0,Finished,Newyork,31,Mrs. Nina,Adgra,1,150000.0
13,A005,Project 14,200000.0,Finished,Madrid,30,Mrs. Amy,Johny,2,10000.0

In [52]:
#Task9
#To read the updated Final dataframe.csv file
Final = pd.read_csv("Final_updated_designation.csv")

In [53]:
#Task9
#Creating new dataframe to calculate total project cost of each employee by importing required colums from Final dataframe
TotalProjCost = Final.groupby('ID')['Cost'].sum().reset_index()  #Using groupby function calculation the total cost of each employee
TotalProjCost['First Name'] = Final['First Name']  #importing 'First Name' column from Final dataframe
TotalProjCost.rename(columns={'Cost': 'Total Cost'}, inplace=True)  # Renaming the cost as 'Total cost'

TotalProjCost

     ID  Total Cost  First Name
0  A001   5212312.5    Mr. John
1  A002   2680000.0  Mrs. Alice
2  A003   5150000.0     Mr. Tom
3  A004   9500000.0   Mrs. Nina
4  A005   3850500.0    Mrs. Amy

In [54]:
#Task9
#Rearranging the columns as per task requirement
TotalProjCost = TotalProjCost.reindex(columns=['ID', 'First Name', 'Total Cost'])

TotalProjCost

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [55]:
#Task10
#Task10
#Filtering b y city name contains 'o' using str.contains function
emp_with_o = Final[Final['City'].str.contains('o', case=False, na=False)]

emp_with_o

,ID,Project,Cost,Status,City,Age,First Name,LastName,Designation Level,Bonus
1,A002,Project 2,2000000.0,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0.0
3,A004,Project 4,5500000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,1,0.0
5,A002,Project 6,680000.0,Failed,London,27,Mrs. Alice,Luxumberg,3,0.0
11,A004,Project 12,1000000.0,Ongoing,Newyork,31,Mrs. Nina,Adgra,1,0.0
12,A004,Project 13,3000000.0,Finished,Newyork,31,Mrs. Nina,Adgra,1,150000.0